# Используем готовый образ Golang версии 1.21.1 как основу для нашего контейнера
FROM golang:1.21.1

# Копируем все файлы из текущей директории (вашего проекта) в корневую директорию контейнера
COPY . /

# Устанавливаем рабочую директорию в корень контейнера
WORKDIR /

# Собираем ваш Go-проект (компилируем) с помощью команды go build и файлом main.go
RUN go build main.go

# Указываем команду, которая будет выполняться при запуске контейнера
CMD ["./main"]

# Открываем порт 8080, чтобы контейнер мог принимать входящие сетевые запросы на этом порту
EXPOSE 8080